examples/IBPartFoam/CouetteCircle/constant/kinematicCloudPositions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       vectorField;
    object      kinematicCloudPositions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

(
//(0.030 0.0 0.0)
//(0.035 0.0 0.0)
//(0.040 0.0 0.0)
//(0.045 0.0 0.0)

//(0.03 0.03 0.0)
(0.025 0.025 0.0)
)

// ************************************************************************* //
